Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/uhpfs.h
/**
 * \brief Component description for UHPFS
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_UHPFS_COMPONENT_H_
#define _SAM9X_UHPFS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR UHPFS                                        */
/* ************************************************************************** */

/* -------- UHPFS_HcRevision : (UHPFS Offset: 0x00) ( R/ 32) OHCI Revision Number Register -------- */
#define UHPFS_HcRevision_REV_Pos              _U_(0)                                               /**< (UHPFS_HcRevision) OHCI Revision Number Position */
#define UHPFS_HcRevision_REV_Msk              (_U_(0xFF) << UHPFS_HcRevision_REV_Pos)              /**< (UHPFS_HcRevision) OHCI Revision Number Mask */
#define UHPFS_HcRevision_REV(value)           (UHPFS_HcRevision_REV_Msk & ((value) << UHPFS_HcRevision_REV_Pos))
#define UHPFS_HcRevision_Msk                  _U_(0x000000FF)                                      /**< (UHPFS_HcRevision) Register Mask  */


/* -------- UHPFS_HcControl : (UHPFS Offset: 0x04) (R/W 32) HC Operating Mode Register -------- */
#define UHPFS_HcControl_CBSR_Pos              _U_(0)                                               /**< (UHPFS_HcControl) Control/Bulk Service Ratio Position */
#define UHPFS_HcControl_CBSR_Msk              (_U_(0x3) << UHPFS_HcControl_CBSR_Pos)               /**< (UHPFS_HcControl) Control/Bulk Service Ratio Mask */
#define UHPFS_HcControl_CBSR(value)           (UHPFS_HcControl_CBSR_Msk & ((value) << UHPFS_HcControl_CBSR_Pos))
#define UHPFS_HcControl_PLE_Pos               _U_(2)                                               /**< (UHPFS_HcControl) Periodic List Enable Position */
#define UHPFS_HcControl_PLE_Msk               (_U_(0x1) << UHPFS_HcControl_PLE_Pos)                /**< (UHPFS_HcControl) Periodic List Enable Mask */
#define UHPFS_HcControl_PLE(value)            (UHPFS_HcControl_PLE_Msk & ((value) << UHPFS_HcControl_PLE_Pos))
#define UHPFS_HcControl_IE_Pos                _U_(3)                                               /**< (UHPFS_HcControl) Isochronous Enable Position */
#define UHPFS_HcControl_IE_Msk                (_U_(0x1) << UHPFS_HcControl_IE_Pos)                 /**< (UHPFS_HcControl) Isochronous Enable Mask */
#define UHPFS_HcControl_IE(value)             (UHPFS_HcControl_IE_Msk & ((value) << UHPFS_HcControl_IE_Pos))
#define UHPFS_HcControl_CLE_Pos               _U_(4)                                               /**< (UHPFS_HcControl) ControL List Enable Position */
#define UHPFS_HcControl_CLE_Msk               (_U_(0x1) << UHPFS_HcControl_CLE_Pos)                /**< (UHPFS_HcControl) ControL List Enable Mask */
#define UHPFS_HcControl_CLE(value)            (UHPFS_HcControl_CLE_Msk & ((value) << UHPFS_HcControl_CLE_Pos))
#define UHPFS_HcControl_BLE_Pos               _U_(5)                                               /**< (UHPFS_HcControl) Bulk List Enable Position */
#define UHPFS_HcControl_BLE_Msk               (_U_(0x1) << UHPFS_HcControl_BLE_Pos)                /**< (UHPFS_HcControl) Bulk List Enable Mask */
#define UHPFS_HcControl_BLE(value)            (UHPFS_HcControl_BLE_Msk & ((value) << UHPFS_HcControl_BLE_Pos))
#define UHPFS_HcControl_HCFS_Pos              _U_(6)                                               /**< (UHPFS_HcControl) Host Controller Functional State Position */
#define UHPFS_HcControl_HCFS_Msk              (_U_(0x3) << UHPFS_HcControl_HCFS_Pos)               /**< (UHPFS_HcControl) Host Controller Functional State Mask */
#define UHPFS_HcControl_HCFS(value)           (UHPFS_HcControl_HCFS_Msk & ((value) << UHPFS_HcControl_HCFS_Pos))
#define UHPFS_HcControl_IR_Pos                _U_(8)                                               /**< (UHPFS_HcControl) Interrupt Routing Position */
#define UHPFS_HcControl_IR_Msk                (_U_(0x1) << UHPFS_HcControl_IR_Pos)                 /**< (UHPFS_HcControl) Interrupt Routing Mask */
#define UHPFS_HcControl_IR(value)             (UHPFS_HcControl_IR_Msk & ((value) << UHPFS_HcControl_IR_Pos))
#define UHPFS_HcControl_RWC_Pos               _U_(9)                                               /**< (UHPFS_HcControl) Remote Wakeup Connected Position */
#define UHPFS_HcControl_RWC_Msk               (_U_(0x1) << UHPFS_HcControl_RWC_Pos)                /**< (UHPFS_HcControl) Remote Wakeup Connected Mask */
#define UHPFS_HcControl_RWC(value)            (UHPFS_HcControl_RWC_Msk & ((value) << UHPFS_HcControl_RWC_Pos))
#define UHPFS_HcControl_RWE_Pos               _U_(10)                                              /**< (UHPFS_HcControl) Remote Wakeup Enable Position */
#define UHPFS_HcControl_RWE_Msk               (_U_(0x1) << UHPFS_HcControl_RWE_Pos)                /**< (UHPFS_HcControl) Remote Wakeup Enable Mask */
#define UHPFS_HcControl_RWE(value)            (UHPFS_HcControl_RWE_Msk & ((value) << UHPFS_HcControl_RWE_Pos))
#define UHPFS_HcControl_Msk                   _U_(0x000007FF)                                      /**< (UHPFS_HcControl) Register Mask  */


/* -------- UHPFS_HcCommandStatus : (UHPFS Offset: 0x08) (R/W 32) HC Command and Status Register -------- */
#define UHPFS_HcCommandStatus_HCR_Pos         _U_(0)                                               /**< (UHPFS_HcCommandStatus) Host Controller Reset (read/write) Position */
#define UHPFS_HcCommandStatus_HCR_Msk         (_U_(0x1) << UHPFS_HcCommandStatus_HCR_Pos)          /**< (UHPFS_HcCommandStatus) Host Controller Reset (read/write) Mask */
#define UHPFS_HcCommandStatus_HCR(value)      (UHPFS_HcCommandStatus_HCR_Msk & ((value) << UHPFS_HcCommandStatus_HCR_Pos))
#define UHPFS_HcCommandStatus_CLF_Pos         _U_(1)                                               /**< (UHPFS_HcCommandStatus) Control List Filled (read/write) Position */
#define UHPFS_HcCommandStatus_CLF_Msk         (_U_(0x1) << UHPFS_HcCommandStatus_CLF_Pos)          /**< (UHPFS_HcCommandStatus) Control List Filled (read/write) Mask */
#define UHPFS_HcCommandStatus_CLF(value)      (UHPFS_HcCommandStatus_CLF_Msk & ((value) << UHPFS_HcCommandStatus_CLF_Pos))
#define UHPFS_HcCommandStatus_BLF_Pos         _U_(2)                                               /**< (UHPFS_HcCommandStatus) Bulk List Filled (read/write) Position */
#define UHPFS_HcCommandStatus_BLF_Msk         (_U_(0x1) << UHPFS_HcCommandStatus_BLF_Pos)          /**< (UHPFS_HcCommandStatus) Bulk List Filled (read/write) Mask */
#define UHPFS_HcCommandStatus_BLF(value)      (UHPFS_HcCommandStatus_BLF_Msk & ((value) << UHPFS_HcCommandStatus_BLF_Pos))
#define UHPFS_HcCommandStatus_OCR_Pos         _U_(3)                                               /**< (UHPFS_HcCommandStatus) Ownership Change Request (read/write) Position */
#define UHPFS_HcCommandStatus_OCR_Msk         (_U_(0x1) << UHPFS_HcCommandStatus_OCR_Pos)          /**< (UHPFS_HcCommandStatus) Ownership Change Request (read/write) Mask */
#define UHPFS_HcCommandStatus_OCR(value)      (UHPFS_HcCommandStatus_OCR_Msk & ((value) << UHPFS_HcCommandStatus_OCR_Pos))
#define UHPFS_HcCommandStatus_SOC_Pos         _U_(16)                                              /**< (UHPFS_HcCommandStatus) Scheduling Overrun Count (read-only) Position */
#define UHPFS_HcCommandStatus_SOC_Msk         (_U_(0x3) << UHPFS_HcCommandStatus_SOC_Pos)          /**< (UHPFS_HcCommandStatus) Scheduling Overrun Count (read-only) Mask */
#define UHPFS_HcCommandStatus_SOC(value)      (UHPFS_HcCommandStatus_SOC_Msk & ((value) << UHPFS_HcCommandStatus_SOC_Pos))
#define UHPFS_HcCommandStatus_Msk             _U_(0x0003000F)                                      /**< (UHPFS_HcCommandStatus) Register Mask  */


/* -------- UHPFS_HcInterruptStatus : (UHPFS Offset: 0x0C) (R/W 32) HC Interrupt and Status Register -------- */
#define UHPFS_HcInterruptStatus_SO_Pos        _U_(0)                                               /**< (UHPFS_HcInterruptStatus) Scheduling Overrun (read/write, write '1' to clear) Position */
#define UHPFS_HcInterruptStatus_SO_Msk        (_U_(0x1) << UHPFS_HcInterruptStatus_SO_Pos)         /**< (UHPFS_HcInterruptStatus) Scheduling Overrun (read/write, write '1' to clear) Mask */
#define UHPFS_HcInterruptStatus_SO(value)     (UHPFS_HcInterruptStatus_SO_Msk & ((value) << UHPFS_HcInterruptStatus_SO_Pos))
#define UHPFS_HcInterruptStatus_WDH_Pos       _U_(1)                                               /**< (UHPFS_HcInterruptStatus) Write Done Head (read/write, write '1' to clear) Position */
#define UHPFS_HcInterruptStatus_WDH_Msk       (_U_(0x1) << UHPFS_HcInterruptStatus_WDH_Pos)        /**< (UHPFS_HcInterruptStatus) Write Done Head (read/write, write '1' to clear) Mask */
#define UHPFS_HcInterruptStatus_WDH(value)    (UHPFS_HcInterruptStatus_WDH_Msk & ((value) << UHPFS_HcInterruptStatus_WDH_Pos))
#define UHPFS_HcInterruptStatus_SF_Pos        _U_(2)                                               /**< (UHPFS_HcInterruptStatus) Start of Frame (read/write, write '1' to clear) Position */
#define UHPFS_HcInterruptStatus_SF_Msk        (_U_(0x1) << UHPFS_HcInterruptStatus_SF_Pos)         /**< (UHPFS_HcInterruptStatus) Start of Frame (read/write, write '1' to clear) Mask */
#define UHPFS_HcInterruptStatus_SF(value)     (UHPFS_HcInterruptStatus_SF_Msk & ((value) << UHPFS_HcInterruptStatus_SF_Pos))
#define UHPFS_HcInterruptStatus_RD_Pos        _U_(3)                                               /**< (UHPFS_HcInterruptStatus) Resume Detected (read/write, write '1' to clear) Position */
#define UHPFS_HcInterruptStatus_RD_Msk        (_U_(0x1) << UHPFS_HcInterruptStatus_RD_Pos)         /**< (UHPFS_HcInterruptStatus) Resume Detected (read/write, write '1' to clear) Mask */
#define UHPFS_HcInterruptStatus_RD(value)     (UHPFS_HcInterruptStatus_RD_Msk & ((value) << UHPFS_HcInterruptStatus_RD_Pos))
#define UHPFS_HcInterruptStatus_UE_Pos        _U_(4)                                               /**< (UHPFS_HcInterruptStatus) Unrecoverable Error (read/write, write '1' to clear) Position */
#define UHPFS_HcInterruptStatus_UE_Msk        (_U_(0x1) << UHPFS_HcInterruptStatus_UE_Pos)         /**< (UHPFS_HcInterruptStatus) Unrecoverable Error (read/write, write '1' to clear) Mask */
#define UHPFS_HcInterruptStatus_UE(value)     (UHPFS_HcInterruptStatus_UE_Msk & ((value) << UHPFS_HcInterruptStatus_UE_Pos))
#define UHPFS_HcInterruptStatus_FNO_Pos       _U_(5)                                               /**< (UHPFS_HcInterruptStatus) Frame Number Overflow (read/write, write '1' to clear) Position */
#define UHPFS_HcInterruptStatus_FNO_Msk       (_U_(0x1) << UHPFS_HcInterruptStatus_FNO_Pos)        /**< (UHPFS_HcInterruptStatus) Frame Number Overflow (read/write, write '1' to clear) Mask */
#define UHPFS_HcInterruptStatus_FNO(value)    (UHPFS_HcInterruptStatus_FNO_Msk & ((value) << UHPFS_HcInterruptStatus_FNO_Pos))
#define UHPFS_HcInterruptStatus_RHSC_Pos      _U_(6)                                               /**< (UHPFS_HcInterruptStatus) Root Hub Status Change (read/write, write '1' to clear) Position */
#define UHPFS_HcInterruptStatus_RHSC_Msk      (_U_(0x1) << UHPFS_HcInterruptStatus_RHSC_Pos)       /**< (UHPFS_HcInterruptStatus) Root Hub Status Change (read/write, write '1' to clear) Mask */
#define UHPFS_HcInterruptStatus_RHSC(value)   (UHPFS_HcInterruptStatus_RHSC_Msk & ((value) << UHPFS_HcInterruptStatus_RHSC_Pos))
#define UHPFS_HcInterruptStatus_OC_Pos        _U_(30)                                              /**< (UHPFS_HcInterruptStatus) Ownership Change (read-only) Position */
#define UHPFS_HcInterruptStatus_OC_Msk        (_U_(0x1) << UHPFS_HcInterruptStatus_OC_Pos)         /**< (UHPFS_HcInterruptStatus) Ownership Change (read-only) Mask */
#define UHPFS_HcInterruptStatus_OC(value)     (UHPFS_HcInterruptStatus_OC_Msk & ((value) << UHPFS_HcInterruptStatus_OC_Pos))
#define UHPFS_HcInterruptStatus_Msk           _U_(0x4000007F)                                      /**< (UHPFS_HcInterruptStatus) Register Mask  */


/* -------- UHPFS_HcInterruptEnable : (UHPFS Offset: 0x10) (R/W 32) HC Interrupt Enable Register -------- */
#define UHPFS_HcInterruptEnable_SO_Pos        _U_(0)                                               /**< (UHPFS_HcInterruptEnable) Scheduling Overrun (read/write, write '1' to set) Position */
#define UHPFS_HcInterruptEnable_SO_Msk        (_U_(0x1) << UHPFS_HcInterruptEnable_SO_Pos)         /**< (UHPFS_HcInterruptEnable) Scheduling Overrun (read/write, write '1' to set) Mask */
#define UHPFS_HcInterruptEnable_SO(value)     (UHPFS_HcInterruptEnable_SO_Msk & ((value) << UHPFS_HcInterruptEnable_SO_Pos))
#define UHPFS_HcInterruptEnable_WDH_Pos       _U_(1)                                               /**< (UHPFS_HcInterruptEnable) Write Done Head (read/write, write '1' to set) Position */
#define UHPFS_HcInterruptEnable_WDH_Msk       (_U_(0x1) << UHPFS_HcInterruptEnable_WDH_Pos)        /**< (UHPFS_HcInterruptEnable) Write Done Head (read/write, write '1' to set) Mask */
#define UHPFS_HcInterruptEnable_WDH(value)    (UHPFS_HcInterruptEnable_WDH_Msk & ((value) << UHPFS_HcInterruptEnable_WDH_Pos))
#define UHPFS_HcInterruptEnable_SF_Pos        _U_(2)                                               /**< (UHPFS_HcInterruptEnable) Start of Frame (read/write, write '1' to set) Position */
#define UHPFS_HcInterruptEnable_SF_Msk        (_U_(0x1) << UHPFS_HcInterruptEnable_SF_Pos)         /**< (UHPFS_HcInterruptEnable) Start of Frame (read/write, write '1' to set) Mask */
#define UHPFS_HcInterruptEnable_SF(value)     (UHPFS_HcInterruptEnable_SF_Msk & ((value) << UHPFS_HcInterruptEnable_SF_Pos))
#define UHPFS_HcInterruptEnable_RD_Pos        _U_(3)                                               /**< (UHPFS_HcInterruptEnable) Resume Detected (read/write, write '1' to set) Position */
#define UHPFS_HcInterruptEnable_RD_Msk        (_U_(0x1) << UHPFS_HcInterruptEnable_RD_Pos)         /**< (UHPFS_HcInterruptEnable) Resume Detected (read/write, write '1' to set) Mask */
#define UHPFS_HcInterruptEnable_RD(value)     (UHPFS_HcInterruptEnable_RD_Msk & ((value) << UHPFS_HcInterruptEnable_RD_Pos))
#define UHPFS_HcInterruptEnable_UE_Pos        _U_(4)                                               /**< (UHPFS_HcInterruptEnable) Unrecoverable Error (read/write, write '1' to set) Position */
#define UHPFS_HcInterruptEnable_UE_Msk        (_U_(0x1) << UHPFS_HcInterruptEnable_UE_Pos)         /**< (UHPFS_HcInterruptEnable) Unrecoverable Error (read/write, write '1' to set) Mask */
#define UHPFS_HcInterruptEnable_UE(value)     (UHPFS_HcInterruptEnable_UE_Msk & ((value) << UHPFS_HcInterruptEnable_UE_Pos))
#define UHPFS_HcInterruptEnable_FNO_Pos       _U_(5)                                               /**< (UHPFS_HcInterruptEnable) Frame Number Overflow (read/write, write '1' to set) Position */
#define UHPFS_HcInterruptEnable_FNO_Msk       (_U_(0x1) << UHPFS_HcInterruptEnable_FNO_Pos)        /**< (UHPFS_HcInterruptEnable) Frame Number Overflow (read/write, write '1' to set) Mask */
#define UHPFS_HcInterruptEnable_FNO(value)    (UHPFS_HcInterruptEnable_FNO_Msk & ((value) << UHPFS_HcInterruptEnable_FNO_Pos))
#define UHPFS_HcInterruptEnable_RHSC_Pos      _U_(6)                                               /**< (UHPFS_HcInterruptEnable) Root Hub Status Change (read/write, write '1' to set) Position */
#define UHPFS_HcInterruptEnable_RHSC_Msk      (_U_(0x1) << UHPFS_HcInterruptEnable_RHSC_Pos)       /**< (UHPFS_HcInterruptEnable) Root Hub Status Change (read/write, write '1' to set) Mask */
#define UHPFS_HcInterruptEnable_RHSC(value)   (UHPFS_HcInterruptEnable_RHSC_Msk & ((value) << UHPFS_HcInterruptEnable_RHSC_Pos))
#define UHPFS_HcInterruptEnable_OC_Pos        _U_(30)                                              /**< (UHPFS_HcInterruptEnable) Ownership Change (read-only) Position */
#define UHPFS_HcInterruptEnable_OC_Msk        (_U_(0x1) << UHPFS_HcInterruptEnable_OC_Pos)         /**< (UHPFS_HcInterruptEnable) Ownership Change (read-only) Mask */
#define UHPFS_HcInterruptEnable_OC(value)     (UHPFS_HcInterruptEnable_OC_Msk & ((value) << UHPFS_HcInterruptEnable_OC_Pos))
#define UHPFS_HcInterruptEnable_MIE_Pos       _U_(31)                                              /**< (UHPFS_HcInterruptEnable) Master Interrupt Enable (read/write, write '1' to set) Position */
#define UHPFS_HcInterruptEnable_MIE_Msk       (_U_(0x1) << UHPFS_HcInterruptEnable_MIE_Pos)        /**< (UHPFS_HcInterruptEnable) Master Interrupt Enable (read/write, write '1' to set) Mask */
#define UHPFS_HcInterruptEnable_MIE(value)    (UHPFS_HcInterruptEnable_MIE_Msk & ((value) << UHPFS_HcInterruptEnable_MIE_Pos))
#define UHPFS_HcInterruptEnable_Msk           _U_(0xC000007F)                                      /**< (UHPFS_HcInterruptEnable) Register Mask  */


/* -------- UHPFS_HcInterruptDisable : (UHPFS Offset: 0x14) (R/W 32) HC Interrupt Disable Register -------- */
#define UHPFS_HcInterruptDisable_SO_Pos       _U_(0)                                               /**< (UHPFS_HcInterruptDisable) Scheduling Overrun (read/write) Position */
#define UHPFS_HcInterruptDisable_SO_Msk       (_U_(0x1) << UHPFS_HcInterruptDisable_SO_Pos)        /**< (UHPFS_HcInterruptDisable) Scheduling Overrun (read/write) Mask */
#define UHPFS_HcInterruptDisable_SO(value)    (UHPFS_HcInterruptDisable_SO_Msk & ((value) << UHPFS_HcInterruptDisable_SO_Pos))
#define UHPFS_HcInterruptDisable_WDH_Pos      _U_(1)                                               /**< (UHPFS_HcInterruptDisable) Write Done Head (read/write) Position */
#define UHPFS_HcInterruptDisable_WDH_Msk      (_U_(0x1) << UHPFS_HcInterruptDisable_WDH_Pos)       /**< (UHPFS_HcInterruptDisable) Write Done Head (read/write) Mask */
#define UHPFS_HcInterruptDisable_WDH(value)   (UHPFS_HcInterruptDisable_WDH_Msk & ((value) << UHPFS_HcInterruptDisable_WDH_Pos))
#define UHPFS_HcInterruptDisable_SF_Pos       _U_(2)                                               /**< (UHPFS_HcInterruptDisable) Start of Frame (read/write) Position */
#define UHPFS_HcInterruptDisable_SF_Msk       (_U_(0x1) << UHPFS_HcInterruptDisable_SF_Pos)        /**< (UHPFS_HcInterruptDisable) Start of Frame (read/write) Mask */
#define UHPFS_HcInterruptDisable_SF(value)    (UHPFS_HcInterruptDisable_SF_Msk & ((value) << UHPFS_HcInterruptDisable_SF_Pos))
#define UHPFS_HcInterruptDisable_RD_Pos       _U_(3)                                               /**< (UHPFS_HcInterruptDisable) Resume Detected (read/write) Position */
#define UHPFS_HcInterruptDisable_RD_Msk       (_U_(0x1) << UHPFS_HcInterruptDisable_RD_Pos)        /**< (UHPFS_HcInterruptDisable) Resume Detected (read/write) Mask */
#define UHPFS_HcInterruptDisable_RD(value)    (UHPFS_HcInterruptDisable_RD_Msk & ((value) << UHPFS_HcInterruptDisable_RD_Pos))
#define UHPFS_HcInterruptDisable_UE_Pos       _U_(4)                                               /**< (UHPFS_HcInterruptDisable) Unrecoverable Error (read/write) Position */
#define UHPFS_HcInterruptDisable_UE_Msk       (_U_(0x1) << UHPFS_HcInterruptDisable_UE_Pos)        /**< (UHPFS_HcInterruptDisable) Unrecoverable Error (read/write) Mask */
#define UHPFS_HcInterruptDisable_UE(value)    (UHPFS_HcInterruptDisable_UE_Msk & ((value) << UHPFS_HcInterruptDisable_UE_Pos))
#define UHPFS_HcInterruptDisable_FNO_Pos      _U_(5)                                               /**< (UHPFS_HcInterruptDisable) Frame Number Overflow (read/write) Position */
#define UHPFS_HcInterruptDisable_FNO_Msk      (_U_(0x1) << UHPFS_HcInterruptDisable_FNO_Pos)       /**< (UHPFS_HcInterruptDisable) Frame Number Overflow (read/write) Mask */
#define UHPFS_HcInterruptDisable_FNO(value)   (UHPFS_HcInterruptDisable_FNO_Msk & ((value) << UHPFS_HcInterruptDisable_FNO_Pos))
#define UHPFS_HcInterruptDisable_RHSC_Pos     _U_(6)                                               /**< (UHPFS_HcInterruptDisable) Root Hub Status Change (read/write) Position */
#define UHPFS_HcInterruptDisable_RHSC_Msk     (_U_(0x1) << UHPFS_HcInterruptDisable_RHSC_Pos)      /**< (UHPFS_HcInterruptDisable) Root Hub Status Change (read/write) Mask */
#define UHPFS_HcInterruptDisable_RHSC(value)  (UHPFS_HcInterruptDisable_RHSC_Msk & ((value) << UHPFS_HcInterruptDisable_RHSC_Pos))
#define UHPFS_HcInterruptDisable_OC_Pos       _U_(30)                                              /**< (UHPFS_HcInterruptDisable) Ownership Change (read-only) Position */
#define UHPFS_HcInterruptDisable_OC_Msk       (_U_(0x1) << UHPFS_HcInterruptDisable_OC_Pos)        /**< (UHPFS_HcInterruptDisable) Ownership Change (read-only) Mask */
#define UHPFS_HcInterruptDisable_OC(value)    (UHPFS_HcInterruptDisable_OC_Msk & ((value) << UHPFS_HcInterruptDisable_OC_Pos))
#define UHPFS_HcInterruptDisable_MIE_Pos      _U_(31)                                              /**< (UHPFS_HcInterruptDisable) Master Interrupt Enable (read/write) Position */
#define UHPFS_HcInterruptDisable_MIE_Msk      (_U_(0x1) << UHPFS_HcInterruptDisable_MIE_Pos)       /**< (UHPFS_HcInterruptDisable) Master Interrupt Enable (read/write) Mask */
#define UHPFS_HcInterruptDisable_MIE(value)   (UHPFS_HcInterruptDisable_MIE_Msk & ((value) << UHPFS_HcInterruptDisable_MIE_Pos))
#define UHPFS_HcInterruptDisable_Msk          _U_(0xC000007F)                                      /**< (UHPFS_HcInterruptDisable) Register Mask  */


/* -------- UHPFS_HcHCCA : (UHPFS Offset: 0x18) (R/W 32) HC HCCA Address Register -------- */
#define UHPFS_HcHCCA_HCCA_Pos                 _U_(8)                                               /**< (UHPFS_HcHCCA) Physical Address of the Beginning of the HCCA Position */
#define UHPFS_HcHCCA_HCCA_Msk                 (_U_(0xFFFFFF) << UHPFS_HcHCCA_HCCA_Pos)             /**< (UHPFS_HcHCCA) Physical Address of the Beginning of the HCCA Mask */
#define UHPFS_HcHCCA_HCCA(value)              (UHPFS_HcHCCA_HCCA_Msk & ((value) << UHPFS_HcHCCA_HCCA_Pos))
#define UHPFS_HcHCCA_Msk                      _U_(0xFFFFFF00)                                      /**< (UHPFS_HcHCCA) Register Mask  */


