Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/uhpfs.h
/* -------- UHPFS_HcPeriodCurrentED : (UHPFS Offset: 0x1C) (R/W 32) HC Current Periodic Register -------- */
#define UHPFS_HcPeriodCurrentED_PCED_Pos      _U_(4)                                               /**< (UHPFS_HcPeriodCurrentED) Physical Address of the Current ED on the Periodic ED list Position */
#define UHPFS_HcPeriodCurrentED_PCED_Msk      (_U_(0xFFFFFFF) << UHPFS_HcPeriodCurrentED_PCED_Pos) /**< (UHPFS_HcPeriodCurrentED) Physical Address of the Current ED on the Periodic ED list Mask */
#define UHPFS_HcPeriodCurrentED_PCED(value)   (UHPFS_HcPeriodCurrentED_PCED_Msk & ((value) << UHPFS_HcPeriodCurrentED_PCED_Pos))
#define UHPFS_HcPeriodCurrentED_Msk           _U_(0xFFFFFFF0)                                      /**< (UHPFS_HcPeriodCurrentED) Register Mask  */


/* -------- UHPFS_HcControlHeadED : (UHPFS Offset: 0x20) (R/W 32) HC Head Control Register -------- */
#define UHPFS_HcControlHeadED_CHED_Pos        _U_(4)                                               /**< (UHPFS_HcControlHeadED) Physical Address of the Head ED on the Control ED list Position */
#define UHPFS_HcControlHeadED_CHED_Msk        (_U_(0xFFFFFFF) << UHPFS_HcControlHeadED_CHED_Pos)   /**< (UHPFS_HcControlHeadED) Physical Address of the Head ED on the Control ED list Mask */
#define UHPFS_HcControlHeadED_CHED(value)     (UHPFS_HcControlHeadED_CHED_Msk & ((value) << UHPFS_HcControlHeadED_CHED_Pos))
#define UHPFS_HcControlHeadED_Msk             _U_(0xFFFFFFF0)                                      /**< (UHPFS_HcControlHeadED) Register Mask  */


/* -------- UHPFS_HcControlCurrentED : (UHPFS Offset: 0x24) (R/W 32) HC Current Control Register -------- */
#define UHPFS_HcControlCurrentED_CCED_Pos     _U_(4)                                               /**< (UHPFS_HcControlCurrentED) Physical Address of the Current ED on the Control ED List Position */
#define UHPFS_HcControlCurrentED_CCED_Msk     (_U_(0xFFFFFFF) << UHPFS_HcControlCurrentED_CCED_Pos) /**< (UHPFS_HcControlCurrentED) Physical Address of the Current ED on the Control ED List Mask */
#define UHPFS_HcControlCurrentED_CCED(value)  (UHPFS_HcControlCurrentED_CCED_Msk & ((value) << UHPFS_HcControlCurrentED_CCED_Pos))
#define UHPFS_HcControlCurrentED_Msk          _U_(0xFFFFFFF0)                                      /**< (UHPFS_HcControlCurrentED) Register Mask  */


/* -------- UHPFS_HcBulkHeadED : (UHPFS Offset: 0x28) (R/W 32) HC Head Bulk Register -------- */
#define UHPFS_HcBulkHeadED_BHED_Pos           _U_(4)                                               /**< (UHPFS_HcBulkHeadED) Physical Address of the Head ED on the Bulk ED List Position */
#define UHPFS_HcBulkHeadED_BHED_Msk           (_U_(0xFFFFFFF) << UHPFS_HcBulkHeadED_BHED_Pos)      /**< (UHPFS_HcBulkHeadED) Physical Address of the Head ED on the Bulk ED List Mask */
#define UHPFS_HcBulkHeadED_BHED(value)        (UHPFS_HcBulkHeadED_BHED_Msk & ((value) << UHPFS_HcBulkHeadED_BHED_Pos))
#define UHPFS_HcBulkHeadED_Msk                _U_(0xFFFFFFF0)                                      /**< (UHPFS_HcBulkHeadED) Register Mask  */


/* -------- UHPFS_HcBulkCurrentED : (UHPFS Offset: 0x2C) (R/W 32) HC Current Bulk Register -------- */
#define UHPFS_HcBulkCurrentED_BCED_Pos        _U_(4)                                               /**< (UHPFS_HcBulkCurrentED) Physical Address of the Current ED on the Bulk ED List Position */
#define UHPFS_HcBulkCurrentED_BCED_Msk        (_U_(0xFFFFFFF) << UHPFS_HcBulkCurrentED_BCED_Pos)   /**< (UHPFS_HcBulkCurrentED) Physical Address of the Current ED on the Bulk ED List Mask */
#define UHPFS_HcBulkCurrentED_BCED(value)     (UHPFS_HcBulkCurrentED_BCED_Msk & ((value) << UHPFS_HcBulkCurrentED_BCED_Pos))
#define UHPFS_HcBulkCurrentED_Msk             _U_(0xFFFFFFF0)                                      /**< (UHPFS_HcBulkCurrentED) Register Mask  */


/* -------- UHPFS_HcDoneHead : (UHPFS Offset: 0x30) (R/W 32) HC Head Done Register -------- */
#define UHPFS_HcDoneHead_DH_Pos               _U_(4)                                               /**< (UHPFS_HcDoneHead) Physical Address of the Last TD that has added to the done queue Position */
#define UHPFS_HcDoneHead_DH_Msk               (_U_(0xFFFFFFF) << UHPFS_HcDoneHead_DH_Pos)          /**< (UHPFS_HcDoneHead) Physical Address of the Last TD that has added to the done queue Mask */
#define UHPFS_HcDoneHead_DH(value)            (UHPFS_HcDoneHead_DH_Msk & ((value) << UHPFS_HcDoneHead_DH_Pos))
#define UHPFS_HcDoneHead_Msk                  _U_(0xFFFFFFF0)                                      /**< (UHPFS_HcDoneHead) Register Mask  */


/* -------- UHPFS_HcFmInterval : (UHPFS Offset: 0x34) (R/W 32) HC Frame Interval Register -------- */
#define UHPFS_HcFmInterval_FRAMEINTERVAL_Pos  _U_(0)                                               /**< (UHPFS_HcFmInterval) Frame Interval Position */
#define UHPFS_HcFmInterval_FRAMEINTERVAL_Msk  (_U_(0x3FFF) << UHPFS_HcFmInterval_FRAMEINTERVAL_Pos) /**< (UHPFS_HcFmInterval) Frame Interval Mask */
#define UHPFS_HcFmInterval_FRAMEINTERVAL(value) (UHPFS_HcFmInterval_FRAMEINTERVAL_Msk & ((value) << UHPFS_HcFmInterval_FRAMEINTERVAL_Pos))
#define UHPFS_HcFmInterval_FSMPS_Pos          _U_(16)                                              /**< (UHPFS_HcFmInterval) Largest Data Packet Position */
#define UHPFS_HcFmInterval_FSMPS_Msk          (_U_(0x7FFF) << UHPFS_HcFmInterval_FSMPS_Pos)        /**< (UHPFS_HcFmInterval) Largest Data Packet Mask */
#define UHPFS_HcFmInterval_FSMPS(value)       (UHPFS_HcFmInterval_FSMPS_Msk & ((value) << UHPFS_HcFmInterval_FSMPS_Pos))
#define UHPFS_HcFmInterval_FIT_Pos            _U_(31)                                              /**< (UHPFS_HcFmInterval) Frame Interval Toggle Position */
#define UHPFS_HcFmInterval_FIT_Msk            (_U_(0x1) << UHPFS_HcFmInterval_FIT_Pos)             /**< (UHPFS_HcFmInterval) Frame Interval Toggle Mask */
#define UHPFS_HcFmInterval_FIT(value)         (UHPFS_HcFmInterval_FIT_Msk & ((value) << UHPFS_HcFmInterval_FIT_Pos))
#define UHPFS_HcFmInterval_Msk                _U_(0xFFFF3FFF)                                      /**< (UHPFS_HcFmInterval) Register Mask  */


/* -------- UHPFS_HcFmRemaining : (UHPFS Offset: 0x38) (R/W 32) HC Frame Remaining Register -------- */
#define UHPFS_HcFmRemaining_FR_Pos            _U_(0)                                               /**< (UHPFS_HcFmRemaining) Frame Remaining Position */
#define UHPFS_HcFmRemaining_FR_Msk            (_U_(0x3FFF) << UHPFS_HcFmRemaining_FR_Pos)          /**< (UHPFS_HcFmRemaining) Frame Remaining Mask */
#define UHPFS_HcFmRemaining_FR(value)         (UHPFS_HcFmRemaining_FR_Msk & ((value) << UHPFS_HcFmRemaining_FR_Pos))
#define UHPFS_HcFmRemaining_FRT_Pos           _U_(31)                                              /**< (UHPFS_HcFmRemaining) Frame Remaining Toggle Position */
#define UHPFS_HcFmRemaining_FRT_Msk           (_U_(0x1) << UHPFS_HcFmRemaining_FRT_Pos)            /**< (UHPFS_HcFmRemaining) Frame Remaining Toggle Mask */
#define UHPFS_HcFmRemaining_FRT(value)        (UHPFS_HcFmRemaining_FRT_Msk & ((value) << UHPFS_HcFmRemaining_FRT_Pos))
#define UHPFS_HcFmRemaining_Msk               _U_(0x80003FFF)                                      /**< (UHPFS_HcFmRemaining) Register Mask  */


/* -------- UHPFS_HcFmNumber : (UHPFS Offset: 0x3C) (R/W 32) HC Frame Number Register -------- */
#define UHPFS_HcFmNumber_FN_Pos               _U_(0)                                               /**< (UHPFS_HcFmNumber) Frame Number Position */
#define UHPFS_HcFmNumber_FN_Msk               (_U_(0xFFFF) << UHPFS_HcFmNumber_FN_Pos)             /**< (UHPFS_HcFmNumber) Frame Number Mask */
#define UHPFS_HcFmNumber_FN(value)            (UHPFS_HcFmNumber_FN_Msk & ((value) << UHPFS_HcFmNumber_FN_Pos))
#define UHPFS_HcFmNumber_Msk                  _U_(0x0000FFFF)                                      /**< (UHPFS_HcFmNumber) Register Mask  */


/* -------- UHPFS_HcPeriodicStart : (UHPFS Offset: 0x40) (R/W 32) HC Periodic Start Register -------- */
#define UHPFS_HcPeriodicStart_PS_Pos          _U_(0)                                               /**< (UHPFS_HcPeriodicStart) Periodic Start Position */
#define UHPFS_HcPeriodicStart_PS_Msk          (_U_(0x3FFF) << UHPFS_HcPeriodicStart_PS_Pos)        /**< (UHPFS_HcPeriodicStart) Periodic Start Mask */
#define UHPFS_HcPeriodicStart_PS(value)       (UHPFS_HcPeriodicStart_PS_Msk & ((value) << UHPFS_HcPeriodicStart_PS_Pos))
#define UHPFS_HcPeriodicStart_Msk             _U_(0x00003FFF)                                      /**< (UHPFS_HcPeriodicStart) Register Mask  */


/* -------- UHPFS_HcLSThreshold : (UHPFS Offset: 0x44) (R/W 32) HC Low-Speed Threshold Register -------- */
#define UHPFS_HcLSThreshold_LST_Pos           _U_(0)                                               /**< (UHPFS_HcLSThreshold) Low-Speed Threshold Position */
#define UHPFS_HcLSThreshold_LST_Msk           (_U_(0x3FFF) << UHPFS_HcLSThreshold_LST_Pos)         /**< (UHPFS_HcLSThreshold) Low-Speed Threshold Mask */
#define UHPFS_HcLSThreshold_LST(value)        (UHPFS_HcLSThreshold_LST_Msk & ((value) << UHPFS_HcLSThreshold_LST_Pos))
#define UHPFS_HcLSThreshold_Msk               _U_(0x00003FFF)                                      /**< (UHPFS_HcLSThreshold) Register Mask  */


