Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/uhpfs.h
/* -------- UHPFS_HcRhDescriptorA : (UHPFS Offset: 0x48) (R/W 32) HC Root Hub A Register -------- */
#define UHPFS_HcRhDescriptorA_NDP_Pos         _U_(0)                                               /**< (UHPFS_HcRhDescriptorA) Number of Downstream Ports (read-only) Position */
#define UHPFS_HcRhDescriptorA_NDP_Msk         (_U_(0xFF) << UHPFS_HcRhDescriptorA_NDP_Pos)         /**< (UHPFS_HcRhDescriptorA) Number of Downstream Ports (read-only) Mask */
#define UHPFS_HcRhDescriptorA_NDP(value)      (UHPFS_HcRhDescriptorA_NDP_Msk & ((value) << UHPFS_HcRhDescriptorA_NDP_Pos))
#define UHPFS_HcRhDescriptorA_PSM_Pos         _U_(8)                                               /**< (UHPFS_HcRhDescriptorA) Power Switching Mode (read/write) Position */
#define UHPFS_HcRhDescriptorA_PSM_Msk         (_U_(0x1) << UHPFS_HcRhDescriptorA_PSM_Pos)          /**< (UHPFS_HcRhDescriptorA) Power Switching Mode (read/write) Mask */
#define UHPFS_HcRhDescriptorA_PSM(value)      (UHPFS_HcRhDescriptorA_PSM_Msk & ((value) << UHPFS_HcRhDescriptorA_PSM_Pos))
#define UHPFS_HcRhDescriptorA_NPS_Pos         _U_(9)                                               /**< (UHPFS_HcRhDescriptorA) No Power Switching (read/write) Position */
#define UHPFS_HcRhDescriptorA_NPS_Msk         (_U_(0x1) << UHPFS_HcRhDescriptorA_NPS_Pos)          /**< (UHPFS_HcRhDescriptorA) No Power Switching (read/write) Mask */
#define UHPFS_HcRhDescriptorA_NPS(value)      (UHPFS_HcRhDescriptorA_NPS_Msk & ((value) << UHPFS_HcRhDescriptorA_NPS_Pos))
#define UHPFS_HcRhDescriptorA_DT_Pos          _U_(10)                                              /**< (UHPFS_HcRhDescriptorA) Device Type (read-only) Position */
#define UHPFS_HcRhDescriptorA_DT_Msk          (_U_(0x1) << UHPFS_HcRhDescriptorA_DT_Pos)           /**< (UHPFS_HcRhDescriptorA) Device Type (read-only) Mask */
#define UHPFS_HcRhDescriptorA_DT(value)       (UHPFS_HcRhDescriptorA_DT_Msk & ((value) << UHPFS_HcRhDescriptorA_DT_Pos))
#define UHPFS_HcRhDescriptorA_OCPM_Pos        _U_(11)                                              /**< (UHPFS_HcRhDescriptorA) Overcurrent Protection Mode (read/write) Position */
#define UHPFS_HcRhDescriptorA_OCPM_Msk        (_U_(0x1) << UHPFS_HcRhDescriptorA_OCPM_Pos)         /**< (UHPFS_HcRhDescriptorA) Overcurrent Protection Mode (read/write) Mask */
#define UHPFS_HcRhDescriptorA_OCPM(value)     (UHPFS_HcRhDescriptorA_OCPM_Msk & ((value) << UHPFS_HcRhDescriptorA_OCPM_Pos))
#define UHPFS_HcRhDescriptorA_NOCP_Pos        _U_(12)                                              /**< (UHPFS_HcRhDescriptorA) No Overcurrent Protection (read/write) Position */
#define UHPFS_HcRhDescriptorA_NOCP_Msk        (_U_(0x1) << UHPFS_HcRhDescriptorA_NOCP_Pos)         /**< (UHPFS_HcRhDescriptorA) No Overcurrent Protection (read/write) Mask */
#define UHPFS_HcRhDescriptorA_NOCP(value)     (UHPFS_HcRhDescriptorA_NOCP_Msk & ((value) << UHPFS_HcRhDescriptorA_NOCP_Pos))
#define UHPFS_HcRhDescriptorA_POTPG_Pos       _U_(24)                                              /**< (UHPFS_HcRhDescriptorA) Power-On to Power-good Time (read/write) Position */
#define UHPFS_HcRhDescriptorA_POTPG_Msk       (_U_(0xFF) << UHPFS_HcRhDescriptorA_POTPG_Pos)       /**< (UHPFS_HcRhDescriptorA) Power-On to Power-good Time (read/write) Mask */
#define UHPFS_HcRhDescriptorA_POTPG(value)    (UHPFS_HcRhDescriptorA_POTPG_Msk & ((value) << UHPFS_HcRhDescriptorA_POTPG_Pos))
#define UHPFS_HcRhDescriptorA_Msk             _U_(0xFF001FFF)                                      /**< (UHPFS_HcRhDescriptorA) Register Mask  */


/* -------- UHPFS_HcRhDescriptorB : (UHPFS Offset: 0x4C) (R/W 32) HC Root Hub B Register -------- */
#define UHPFS_HcRhDescriptorB_DR0_Pos         _U_(0)                                               /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR0_Msk         (_U_(0x1) << UHPFS_HcRhDescriptorB_DR0_Pos)          /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR0(value)      (UHPFS_HcRhDescriptorB_DR0_Msk & ((value) << UHPFS_HcRhDescriptorB_DR0_Pos))
#define UHPFS_HcRhDescriptorB_DR1_Pos         _U_(1)                                               /**< (UHPFS_HcRhDescriptorB) Device Removable Bit for Downstream Port 1 Position */
#define UHPFS_HcRhDescriptorB_DR1_Msk         (_U_(0x1) << UHPFS_HcRhDescriptorB_DR1_Pos)          /**< (UHPFS_HcRhDescriptorB) Device Removable Bit for Downstream Port 1 Mask */
#define UHPFS_HcRhDescriptorB_DR1(value)      (UHPFS_HcRhDescriptorB_DR1_Msk & ((value) << UHPFS_HcRhDescriptorB_DR1_Pos))
#define UHPFS_HcRhDescriptorB_DR2_Pos         _U_(2)                                               /**< (UHPFS_HcRhDescriptorB) Device Removable Bit for Downstream Port 2 Position */
#define UHPFS_HcRhDescriptorB_DR2_Msk         (_U_(0x1) << UHPFS_HcRhDescriptorB_DR2_Pos)          /**< (UHPFS_HcRhDescriptorB) Device Removable Bit for Downstream Port 2 Mask */
#define UHPFS_HcRhDescriptorB_DR2(value)      (UHPFS_HcRhDescriptorB_DR2_Msk & ((value) << UHPFS_HcRhDescriptorB_DR2_Pos))
#define UHPFS_HcRhDescriptorB_DR3_Pos         _U_(3)                                               /**< (UHPFS_HcRhDescriptorB) Device Removable Bit for Downstream Port 3 Position */
#define UHPFS_HcRhDescriptorB_DR3_Msk         (_U_(0x1) << UHPFS_HcRhDescriptorB_DR3_Pos)          /**< (UHPFS_HcRhDescriptorB) Device Removable Bit for Downstream Port 3 Mask */
#define UHPFS_HcRhDescriptorB_DR3(value)      (UHPFS_HcRhDescriptorB_DR3_Msk & ((value) << UHPFS_HcRhDescriptorB_DR3_Pos))
#define UHPFS_HcRhDescriptorB_DR4_Pos         _U_(4)                                               /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR4_Msk         (_U_(0x1) << UHPFS_HcRhDescriptorB_DR4_Pos)          /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR4(value)      (UHPFS_HcRhDescriptorB_DR4_Msk & ((value) << UHPFS_HcRhDescriptorB_DR4_Pos))
#define UHPFS_HcRhDescriptorB_DR5_Pos         _U_(5)                                               /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR5_Msk         (_U_(0x1) << UHPFS_HcRhDescriptorB_DR5_Pos)          /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR5(value)      (UHPFS_HcRhDescriptorB_DR5_Msk & ((value) << UHPFS_HcRhDescriptorB_DR5_Pos))
#define UHPFS_HcRhDescriptorB_DR6_Pos         _U_(6)                                               /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR6_Msk         (_U_(0x1) << UHPFS_HcRhDescriptorB_DR6_Pos)          /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR6(value)      (UHPFS_HcRhDescriptorB_DR6_Msk & ((value) << UHPFS_HcRhDescriptorB_DR6_Pos))
#define UHPFS_HcRhDescriptorB_DR7_Pos         _U_(7)                                               /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR7_Msk         (_U_(0x1) << UHPFS_HcRhDescriptorB_DR7_Pos)          /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR7(value)      (UHPFS_HcRhDescriptorB_DR7_Msk & ((value) << UHPFS_HcRhDescriptorB_DR7_Pos))
#define UHPFS_HcRhDescriptorB_DR8_Pos         _U_(8)                                               /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR8_Msk         (_U_(0x1) << UHPFS_HcRhDescriptorB_DR8_Pos)          /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR8(value)      (UHPFS_HcRhDescriptorB_DR8_Msk & ((value) << UHPFS_HcRhDescriptorB_DR8_Pos))
#define UHPFS_HcRhDescriptorB_DR9_Pos         _U_(9)                                               /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR9_Msk         (_U_(0x1) << UHPFS_HcRhDescriptorB_DR9_Pos)          /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR9(value)      (UHPFS_HcRhDescriptorB_DR9_Msk & ((value) << UHPFS_HcRhDescriptorB_DR9_Pos))
#define UHPFS_HcRhDescriptorB_DR10_Pos        _U_(10)                                              /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR10_Msk        (_U_(0x1) << UHPFS_HcRhDescriptorB_DR10_Pos)         /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR10(value)     (UHPFS_HcRhDescriptorB_DR10_Msk & ((value) << UHPFS_HcRhDescriptorB_DR10_Pos))
#define UHPFS_HcRhDescriptorB_DR11_Pos        _U_(11)                                              /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR11_Msk        (_U_(0x1) << UHPFS_HcRhDescriptorB_DR11_Pos)         /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR11(value)     (UHPFS_HcRhDescriptorB_DR11_Msk & ((value) << UHPFS_HcRhDescriptorB_DR11_Pos))
#define UHPFS_HcRhDescriptorB_DR12_Pos        _U_(12)                                              /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR12_Msk        (_U_(0x1) << UHPFS_HcRhDescriptorB_DR12_Pos)         /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR12(value)     (UHPFS_HcRhDescriptorB_DR12_Msk & ((value) << UHPFS_HcRhDescriptorB_DR12_Pos))
#define UHPFS_HcRhDescriptorB_DR13_Pos        _U_(13)                                              /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR13_Msk        (_U_(0x1) << UHPFS_HcRhDescriptorB_DR13_Pos)         /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR13(value)     (UHPFS_HcRhDescriptorB_DR13_Msk & ((value) << UHPFS_HcRhDescriptorB_DR13_Pos))
#define UHPFS_HcRhDescriptorB_DR14_Pos        _U_(14)                                              /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR14_Msk        (_U_(0x1) << UHPFS_HcRhDescriptorB_DR14_Pos)         /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR14(value)     (UHPFS_HcRhDescriptorB_DR14_Msk & ((value) << UHPFS_HcRhDescriptorB_DR14_Pos))
#define UHPFS_HcRhDescriptorB_DR15_Pos        _U_(15)                                              /**< (UHPFS_HcRhDescriptorB) Device Removable Position */
#define UHPFS_HcRhDescriptorB_DR15_Msk        (_U_(0x1) << UHPFS_HcRhDescriptorB_DR15_Pos)         /**< (UHPFS_HcRhDescriptorB) Device Removable Mask */
#define UHPFS_HcRhDescriptorB_DR15(value)     (UHPFS_HcRhDescriptorB_DR15_Msk & ((value) << UHPFS_HcRhDescriptorB_DR15_Pos))
#define UHPFS_HcRhDescriptorB_PPCM0_Pos       _U_(16)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM0_Msk       (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM0_Pos)        /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM0(value)    (UHPFS_HcRhDescriptorB_PPCM0_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM0_Pos))
#define UHPFS_HcRhDescriptorB_PPCM1_Pos       _U_(17)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask for Downstream Port 1 Position */
#define UHPFS_HcRhDescriptorB_PPCM1_Msk       (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM1_Pos)        /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask for Downstream Port 1 Mask */
#define UHPFS_HcRhDescriptorB_PPCM1(value)    (UHPFS_HcRhDescriptorB_PPCM1_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM1_Pos))
#define UHPFS_HcRhDescriptorB_PPCM2_Pos       _U_(18)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask for Downstream Port 2 Position */
#define UHPFS_HcRhDescriptorB_PPCM2_Msk       (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM2_Pos)        /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask for Downstream Port 2 Mask */
#define UHPFS_HcRhDescriptorB_PPCM2(value)    (UHPFS_HcRhDescriptorB_PPCM2_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM2_Pos))
#define UHPFS_HcRhDescriptorB_PPCM3_Pos       _U_(19)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask for Downstream Port 3 Position */
#define UHPFS_HcRhDescriptorB_PPCM3_Msk       (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM3_Pos)        /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask for Downstream Port 3 Mask */
#define UHPFS_HcRhDescriptorB_PPCM3(value)    (UHPFS_HcRhDescriptorB_PPCM3_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM3_Pos))
#define UHPFS_HcRhDescriptorB_PPCM4_Pos       _U_(20)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM4_Msk       (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM4_Pos)        /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM4(value)    (UHPFS_HcRhDescriptorB_PPCM4_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM4_Pos))
#define UHPFS_HcRhDescriptorB_PPCM5_Pos       _U_(21)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM5_Msk       (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM5_Pos)        /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM5(value)    (UHPFS_HcRhDescriptorB_PPCM5_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM5_Pos))
#define UHPFS_HcRhDescriptorB_PPCM6_Pos       _U_(22)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM6_Msk       (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM6_Pos)        /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM6(value)    (UHPFS_HcRhDescriptorB_PPCM6_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM6_Pos))
#define UHPFS_HcRhDescriptorB_PPCM7_Pos       _U_(23)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM7_Msk       (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM7_Pos)        /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM7(value)    (UHPFS_HcRhDescriptorB_PPCM7_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM7_Pos))
#define UHPFS_HcRhDescriptorB_PPCM8_Pos       _U_(24)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM8_Msk       (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM8_Pos)        /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM8(value)    (UHPFS_HcRhDescriptorB_PPCM8_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM8_Pos))
#define UHPFS_HcRhDescriptorB_PPCM9_Pos       _U_(25)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM9_Msk       (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM9_Pos)        /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM9(value)    (UHPFS_HcRhDescriptorB_PPCM9_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM9_Pos))
#define UHPFS_HcRhDescriptorB_PPCM10_Pos      _U_(26)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM10_Msk      (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM10_Pos)       /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM10(value)   (UHPFS_HcRhDescriptorB_PPCM10_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM10_Pos))
#define UHPFS_HcRhDescriptorB_PPCM11_Pos      _U_(27)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM11_Msk      (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM11_Pos)       /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM11(value)   (UHPFS_HcRhDescriptorB_PPCM11_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM11_Pos))
#define UHPFS_HcRhDescriptorB_PPCM12_Pos      _U_(28)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM12_Msk      (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM12_Pos)       /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM12(value)   (UHPFS_HcRhDescriptorB_PPCM12_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM12_Pos))
#define UHPFS_HcRhDescriptorB_PPCM13_Pos      _U_(29)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM13_Msk      (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM13_Pos)       /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM13(value)   (UHPFS_HcRhDescriptorB_PPCM13_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM13_Pos))
#define UHPFS_HcRhDescriptorB_PPCM14_Pos      _U_(30)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM14_Msk      (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM14_Pos)       /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM14(value)   (UHPFS_HcRhDescriptorB_PPCM14_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM14_Pos))
#define UHPFS_HcRhDescriptorB_PPCM15_Pos      _U_(31)                                              /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Position */
#define UHPFS_HcRhDescriptorB_PPCM15_Msk      (_U_(0x1) << UHPFS_HcRhDescriptorB_PPCM15_Pos)       /**< (UHPFS_HcRhDescriptorB) Port Power Control Mask Mask */
#define UHPFS_HcRhDescriptorB_PPCM15(value)   (UHPFS_HcRhDescriptorB_PPCM15_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM15_Pos))
#define UHPFS_HcRhDescriptorB_Msk             _U_(0xFFFFFFFF)                                      /**< (UHPFS_HcRhDescriptorB) Register Mask  */

#define UHPFS_HcRhDescriptorB_DR_Pos          _U_(0)                                               /**< (UHPFS_HcRhDescriptorB Position) Device Removable */
#define UHPFS_HcRhDescriptorB_DR_Msk          (_U_(0xFFFF) << UHPFS_HcRhDescriptorB_DR_Pos)        /**< (UHPFS_HcRhDescriptorB Mask) DR */
#define UHPFS_HcRhDescriptorB_DR(value)       (UHPFS_HcRhDescriptorB_DR_Msk & ((value) << UHPFS_HcRhDescriptorB_DR_Pos)) 
#define UHPFS_HcRhDescriptorB_PPCM_Pos        _U_(16)                                              /**< (UHPFS_HcRhDescriptorB Position) Port Power Control Mask */
#define UHPFS_HcRhDescriptorB_PPCM_Msk        (_U_(0xFFFF) << UHPFS_HcRhDescriptorB_PPCM_Pos)      /**< (UHPFS_HcRhDescriptorB Mask) PPCM */
#define UHPFS_HcRhDescriptorB_PPCM(value)     (UHPFS_HcRhDescriptorB_PPCM_Msk & ((value) << UHPFS_HcRhDescriptorB_PPCM_Pos)) 

/* -------- UHPFS_HcRhStatus : (UHPFS Offset: 0x50) (R/W 32) HC Root Hub Status Register -------- */
#define UHPFS_HcRhStatus_LPS_Pos              _U_(0)                                               /**< (UHPFS_HcRhStatus) Local Power Status (read/write) Position */
#define UHPFS_HcRhStatus_LPS_Msk              (_U_(0x1) << UHPFS_HcRhStatus_LPS_Pos)               /**< (UHPFS_HcRhStatus) Local Power Status (read/write) Mask */
#define UHPFS_HcRhStatus_LPS(value)           (UHPFS_HcRhStatus_LPS_Msk & ((value) << UHPFS_HcRhStatus_LPS_Pos))
#define UHPFS_HcRhStatus_OCI_Pos              _U_(1)                                               /**< (UHPFS_HcRhStatus) Overcurrent Indicator (read-only) Position */
#define UHPFS_HcRhStatus_OCI_Msk              (_U_(0x1) << UHPFS_HcRhStatus_OCI_Pos)               /**< (UHPFS_HcRhStatus) Overcurrent Indicator (read-only) Mask */
#define UHPFS_HcRhStatus_OCI(value)           (UHPFS_HcRhStatus_OCI_Msk & ((value) << UHPFS_HcRhStatus_OCI_Pos))
#define UHPFS_HcRhStatus_DRWE_Pos             _U_(15)                                              /**< (UHPFS_HcRhStatus) Device Remote Wakeup Enable (read/write) Position */
#define UHPFS_HcRhStatus_DRWE_Msk             (_U_(0x1) << UHPFS_HcRhStatus_DRWE_Pos)              /**< (UHPFS_HcRhStatus) Device Remote Wakeup Enable (read/write) Mask */
#define UHPFS_HcRhStatus_DRWE(value)          (UHPFS_HcRhStatus_DRWE_Msk & ((value) << UHPFS_HcRhStatus_DRWE_Pos))
#define UHPFS_HcRhStatus_LPSC_Pos             _U_(16)                                              /**< (UHPFS_HcRhStatus) Local Power Status Change (read/write) Position */
#define UHPFS_HcRhStatus_LPSC_Msk             (_U_(0x1) << UHPFS_HcRhStatus_LPSC_Pos)              /**< (UHPFS_HcRhStatus) Local Power Status Change (read/write) Mask */
#define UHPFS_HcRhStatus_LPSC(value)          (UHPFS_HcRhStatus_LPSC_Msk & ((value) << UHPFS_HcRhStatus_LPSC_Pos))
#define UHPFS_HcRhStatus_OCIC_Pos             _U_(17)                                              /**< (UHPFS_HcRhStatus) Overcurrent Indication Change (read/write) Position */
#define UHPFS_HcRhStatus_OCIC_Msk             (_U_(0x1) << UHPFS_HcRhStatus_OCIC_Pos)              /**< (UHPFS_HcRhStatus) Overcurrent Indication Change (read/write) Mask */
#define UHPFS_HcRhStatus_OCIC(value)          (UHPFS_HcRhStatus_OCIC_Msk & ((value) << UHPFS_HcRhStatus_OCIC_Pos))
#define UHPFS_HcRhStatus_CRWE_Pos             _U_(31)                                              /**< (UHPFS_HcRhStatus) Clear Remote Wakeup Enable (read/write) Position */
#define UHPFS_HcRhStatus_CRWE_Msk             (_U_(0x1) << UHPFS_HcRhStatus_CRWE_Pos)              /**< (UHPFS_HcRhStatus) Clear Remote Wakeup Enable (read/write) Mask */
#define UHPFS_HcRhStatus_CRWE(value)          (UHPFS_HcRhStatus_CRWE_Msk & ((value) << UHPFS_HcRhStatus_CRWE_Pos))
#define UHPFS_HcRhStatus_Msk                  _U_(0x80038003)                                      /**< (UHPFS_HcRhStatus) Register Mask  */


