Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/uhpfs.h
/* -------- UHPFS_HcRhPortStatus : (UHPFS Offset: 0x54) (R/W 32) HC Port Status and Control Register (ndp = 0) -------- */
#define UHPFS_HcRhPortStatus_CCS_Pos          _U_(0)                                               /**< (UHPFS_HcRhPortStatus) Port Current Connection Status/clear Port Enable (read/write) Position */
#define UHPFS_HcRhPortStatus_CCS_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_CCS_Pos)           /**< (UHPFS_HcRhPortStatus) Port Current Connection Status/clear Port Enable (read/write) Mask */
#define UHPFS_HcRhPortStatus_CCS(value)       (UHPFS_HcRhPortStatus_CCS_Msk & ((value) << UHPFS_HcRhPortStatus_CCS_Pos))
#define UHPFS_HcRhPortStatus_CPE_Pos          _U_(0)                                               /**< (UHPFS_HcRhPortStatus) Port Current Connection Status/clear Port Enable (read/write) Position */
#define UHPFS_HcRhPortStatus_CPE_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_CPE_Pos)           /**< (UHPFS_HcRhPortStatus) Port Current Connection Status/clear Port Enable (read/write) Mask */
#define UHPFS_HcRhPortStatus_CPE(value)       (UHPFS_HcRhPortStatus_CPE_Msk & ((value) << UHPFS_HcRhPortStatus_CPE_Pos))
#define UHPFS_HcRhPortStatus_PES_Pos          _U_(1)                                               /**< (UHPFS_HcRhPortStatus) Port Enable Status/set Port Enable (read/write) Position */
#define UHPFS_HcRhPortStatus_PES_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_PES_Pos)           /**< (UHPFS_HcRhPortStatus) Port Enable Status/set Port Enable (read/write) Mask */
#define UHPFS_HcRhPortStatus_PES(value)       (UHPFS_HcRhPortStatus_PES_Msk & ((value) << UHPFS_HcRhPortStatus_PES_Pos))
#define UHPFS_HcRhPortStatus_SPE_Pos          _U_(1)                                               /**< (UHPFS_HcRhPortStatus) Port Enable Status/set Port Enable (read/write) Position */
#define UHPFS_HcRhPortStatus_SPE_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_SPE_Pos)           /**< (UHPFS_HcRhPortStatus) Port Enable Status/set Port Enable (read/write) Mask */
#define UHPFS_HcRhPortStatus_SPE(value)       (UHPFS_HcRhPortStatus_SPE_Msk & ((value) << UHPFS_HcRhPortStatus_SPE_Pos))
#define UHPFS_HcRhPortStatus_PSS_Pos          _U_(2)                                               /**< (UHPFS_HcRhPortStatus) Port Suspend Status/set Port Suspend (read/write) Position */
#define UHPFS_HcRhPortStatus_PSS_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_PSS_Pos)           /**< (UHPFS_HcRhPortStatus) Port Suspend Status/set Port Suspend (read/write) Mask */
#define UHPFS_HcRhPortStatus_PSS(value)       (UHPFS_HcRhPortStatus_PSS_Msk & ((value) << UHPFS_HcRhPortStatus_PSS_Pos))
#define UHPFS_HcRhPortStatus_SPS_Pos          _U_(2)                                               /**< (UHPFS_HcRhPortStatus) Port Suspend Status/set Port Suspend (read/write) Position */
#define UHPFS_HcRhPortStatus_SPS_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_SPS_Pos)           /**< (UHPFS_HcRhPortStatus) Port Suspend Status/set Port Suspend (read/write) Mask */
#define UHPFS_HcRhPortStatus_SPS(value)       (UHPFS_HcRhPortStatus_SPS_Msk & ((value) << UHPFS_HcRhPortStatus_SPS_Pos))
#define UHPFS_HcRhPortStatus_POCI_Pos         _U_(3)                                               /**< (UHPFS_HcRhPortStatus) Port Overcurrent Indicator/clear Suspend Status (read/write) Position */
#define UHPFS_HcRhPortStatus_POCI_Msk         (_U_(0x1) << UHPFS_HcRhPortStatus_POCI_Pos)          /**< (UHPFS_HcRhPortStatus) Port Overcurrent Indicator/clear Suspend Status (read/write) Mask */
#define UHPFS_HcRhPortStatus_POCI(value)      (UHPFS_HcRhPortStatus_POCI_Msk & ((value) << UHPFS_HcRhPortStatus_POCI_Pos))
#define UHPFS_HcRhPortStatus_CSS_Pos          _U_(3)                                               /**< (UHPFS_HcRhPortStatus) Port Overcurrent Indicator/clear Suspend Status (read/write) Position */
#define UHPFS_HcRhPortStatus_CSS_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_CSS_Pos)           /**< (UHPFS_HcRhPortStatus) Port Overcurrent Indicator/clear Suspend Status (read/write) Mask */
#define UHPFS_HcRhPortStatus_CSS(value)       (UHPFS_HcRhPortStatus_CSS_Msk & ((value) << UHPFS_HcRhPortStatus_CSS_Pos))
#define UHPFS_HcRhPortStatus_PRS_Pos          _U_(4)                                               /**< (UHPFS_HcRhPortStatus) Port Reset Status/set Port Reset (read/write) Position */
#define UHPFS_HcRhPortStatus_PRS_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_PRS_Pos)           /**< (UHPFS_HcRhPortStatus) Port Reset Status/set Port Reset (read/write) Mask */
#define UHPFS_HcRhPortStatus_PRS(value)       (UHPFS_HcRhPortStatus_PRS_Msk & ((value) << UHPFS_HcRhPortStatus_PRS_Pos))
#define UHPFS_HcRhPortStatus_SPR_Pos          _U_(4)                                               /**< (UHPFS_HcRhPortStatus) Port Reset Status/set Port Reset (read/write) Position */
#define UHPFS_HcRhPortStatus_SPR_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_SPR_Pos)           /**< (UHPFS_HcRhPortStatus) Port Reset Status/set Port Reset (read/write) Mask */
#define UHPFS_HcRhPortStatus_SPR(value)       (UHPFS_HcRhPortStatus_SPR_Msk & ((value) << UHPFS_HcRhPortStatus_SPR_Pos))
#define UHPFS_HcRhPortStatus_PPS_Pos          _U_(8)                                               /**< (UHPFS_HcRhPortStatus) Port Power Status/set Port Power (read/write) Position */
#define UHPFS_HcRhPortStatus_PPS_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_PPS_Pos)           /**< (UHPFS_HcRhPortStatus) Port Power Status/set Port Power (read/write) Mask */
#define UHPFS_HcRhPortStatus_PPS(value)       (UHPFS_HcRhPortStatus_PPS_Msk & ((value) << UHPFS_HcRhPortStatus_PPS_Pos))
#define UHPFS_HcRhPortStatus_SPP_Pos          _U_(8)                                               /**< (UHPFS_HcRhPortStatus) Port Power Status/set Port Power (read/write) Position */
#define UHPFS_HcRhPortStatus_SPP_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_SPP_Pos)           /**< (UHPFS_HcRhPortStatus) Port Power Status/set Port Power (read/write) Mask */
#define UHPFS_HcRhPortStatus_SPP(value)       (UHPFS_HcRhPortStatus_SPP_Msk & ((value) << UHPFS_HcRhPortStatus_SPP_Pos))
#define UHPFS_HcRhPortStatus_LSDA_Pos         _U_(9)                                               /**< (UHPFS_HcRhPortStatus) Low-speed Device Attached/clear Port Power (read/write) Position */
#define UHPFS_HcRhPortStatus_LSDA_Msk         (_U_(0x1) << UHPFS_HcRhPortStatus_LSDA_Pos)          /**< (UHPFS_HcRhPortStatus) Low-speed Device Attached/clear Port Power (read/write) Mask */
#define UHPFS_HcRhPortStatus_LSDA(value)      (UHPFS_HcRhPortStatus_LSDA_Msk & ((value) << UHPFS_HcRhPortStatus_LSDA_Pos))
#define UHPFS_HcRhPortStatus_CPP_Pos          _U_(9)                                               /**< (UHPFS_HcRhPortStatus) Low-speed Device Attached/clear Port Power (read/write) Position */
#define UHPFS_HcRhPortStatus_CPP_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_CPP_Pos)           /**< (UHPFS_HcRhPortStatus) Low-speed Device Attached/clear Port Power (read/write) Mask */
#define UHPFS_HcRhPortStatus_CPP(value)       (UHPFS_HcRhPortStatus_CPP_Msk & ((value) << UHPFS_HcRhPortStatus_CPP_Pos))
#define UHPFS_HcRhPortStatus_CSC_Pos          _U_(16)                                              /**< (UHPFS_HcRhPortStatus) Connect Status Change (read/write, write '1' to clear) Position */
#define UHPFS_HcRhPortStatus_CSC_Msk          (_U_(0x1) << UHPFS_HcRhPortStatus_CSC_Pos)           /**< (UHPFS_HcRhPortStatus) Connect Status Change (read/write, write '1' to clear) Mask */
#define UHPFS_HcRhPortStatus_CSC(value)       (UHPFS_HcRhPortStatus_CSC_Msk & ((value) << UHPFS_HcRhPortStatus_CSC_Pos))
#define UHPFS_HcRhPortStatus_PESC_Pos         _U_(17)                                              /**< (UHPFS_HcRhPortStatus) Port Enable Status Change (read/write, write '1' to clear) Position */
#define UHPFS_HcRhPortStatus_PESC_Msk         (_U_(0x1) << UHPFS_HcRhPortStatus_PESC_Pos)          /**< (UHPFS_HcRhPortStatus) Port Enable Status Change (read/write, write '1' to clear) Mask */
#define UHPFS_HcRhPortStatus_PESC(value)      (UHPFS_HcRhPortStatus_PESC_Msk & ((value) << UHPFS_HcRhPortStatus_PESC_Pos))
#define UHPFS_HcRhPortStatus_PSSC_Pos         _U_(18)                                              /**< (UHPFS_HcRhPortStatus) Port Suspend Status Change (read/write, write '1' to clear) Position */
#define UHPFS_HcRhPortStatus_PSSC_Msk         (_U_(0x1) << UHPFS_HcRhPortStatus_PSSC_Pos)          /**< (UHPFS_HcRhPortStatus) Port Suspend Status Change (read/write, write '1' to clear) Mask */
#define UHPFS_HcRhPortStatus_PSSC(value)      (UHPFS_HcRhPortStatus_PSSC_Msk & ((value) << UHPFS_HcRhPortStatus_PSSC_Pos))
#define UHPFS_HcRhPortStatus_OCIC_Pos         _U_(19)                                              /**< (UHPFS_HcRhPortStatus) Overcurrent Indicator Change (read/write) Position */
#define UHPFS_HcRhPortStatus_OCIC_Msk         (_U_(0x1) << UHPFS_HcRhPortStatus_OCIC_Pos)          /**< (UHPFS_HcRhPortStatus) Overcurrent Indicator Change (read/write) Mask */
#define UHPFS_HcRhPortStatus_OCIC(value)      (UHPFS_HcRhPortStatus_OCIC_Msk & ((value) << UHPFS_HcRhPortStatus_OCIC_Pos))
#define UHPFS_HcRhPortStatus_PRSC_Pos         _U_(20)                                              /**< (UHPFS_HcRhPortStatus) Port Reset Status Change (read/write, write '1' to clear) Position */
#define UHPFS_HcRhPortStatus_PRSC_Msk         (_U_(0x1) << UHPFS_HcRhPortStatus_PRSC_Pos)          /**< (UHPFS_HcRhPortStatus) Port Reset Status Change (read/write, write '1' to clear) Mask */
#define UHPFS_HcRhPortStatus_PRSC(value)      (UHPFS_HcRhPortStatus_PRSC_Msk & ((value) << UHPFS_HcRhPortStatus_PRSC_Pos))
#define UHPFS_HcRhPortStatus_Msk              _U_(0x001F031F)                                      /**< (UHPFS_HcRhPortStatus) Register Mask  */


/** \brief UHPFS register offsets definitions */
#define UHPFS_HcRevision_REG_OFST      (0x00)              /**< (UHPFS_HcRevision) OHCI Revision Number Register Offset */
#define UHPFS_HcControl_REG_OFST       (0x04)              /**< (UHPFS_HcControl) HC Operating Mode Register Offset */
#define UHPFS_HcCommandStatus_REG_OFST (0x08)              /**< (UHPFS_HcCommandStatus) HC Command and Status Register Offset */
#define UHPFS_HcInterruptStatus_REG_OFST (0x0C)              /**< (UHPFS_HcInterruptStatus) HC Interrupt and Status Register Offset */
#define UHPFS_HcInterruptEnable_REG_OFST (0x10)              /**< (UHPFS_HcInterruptEnable) HC Interrupt Enable Register Offset */
#define UHPFS_HcInterruptDisable_REG_OFST (0x14)              /**< (UHPFS_HcInterruptDisable) HC Interrupt Disable Register Offset */
#define UHPFS_HcHCCA_REG_OFST          (0x18)              /**< (UHPFS_HcHCCA) HC HCCA Address Register Offset */
#define UHPFS_HcPeriodCurrentED_REG_OFST (0x1C)              /**< (UHPFS_HcPeriodCurrentED) HC Current Periodic Register Offset */
#define UHPFS_HcControlHeadED_REG_OFST (0x20)              /**< (UHPFS_HcControlHeadED) HC Head Control Register Offset */
#define UHPFS_HcControlCurrentED_REG_OFST (0x24)              /**< (UHPFS_HcControlCurrentED) HC Current Control Register Offset */
#define UHPFS_HcBulkHeadED_REG_OFST    (0x28)              /**< (UHPFS_HcBulkHeadED) HC Head Bulk Register Offset */
#define UHPFS_HcBulkCurrentED_REG_OFST (0x2C)              /**< (UHPFS_HcBulkCurrentED) HC Current Bulk Register Offset */
#define UHPFS_HcDoneHead_REG_OFST      (0x30)              /**< (UHPFS_HcDoneHead) HC Head Done Register Offset */
#define UHPFS_HcFmInterval_REG_OFST    (0x34)              /**< (UHPFS_HcFmInterval) HC Frame Interval Register Offset */
#define UHPFS_HcFmRemaining_REG_OFST   (0x38)              /**< (UHPFS_HcFmRemaining) HC Frame Remaining Register Offset */
#define UHPFS_HcFmNumber_REG_OFST      (0x3C)              /**< (UHPFS_HcFmNumber) HC Frame Number Register Offset */
#define UHPFS_HcPeriodicStart_REG_OFST (0x40)              /**< (UHPFS_HcPeriodicStart) HC Periodic Start Register Offset */
#define UHPFS_HcLSThreshold_REG_OFST   (0x44)              /**< (UHPFS_HcLSThreshold) HC Low-Speed Threshold Register Offset */
#define UHPFS_HcRhDescriptorA_REG_OFST (0x48)              /**< (UHPFS_HcRhDescriptorA) HC Root Hub A Register Offset */
#define UHPFS_HcRhDescriptorB_REG_OFST (0x4C)              /**< (UHPFS_HcRhDescriptorB) HC Root Hub B Register Offset */
#define UHPFS_HcRhStatus_REG_OFST      (0x50)              /**< (UHPFS_HcRhStatus) HC Root Hub Status Register Offset */
#define UHPFS_HcRhPortStatus_REG_OFST  (0x54)              /**< (UHPFS_HcRhPortStatus) HC Port Status and Control Register (ndp = 0) Offset */

