Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/uhpfs.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief UHPFS register API structure */
typedef struct
{
  __I   uint32_t                       UHPFS_HcRevision;   /**< Offset: 0x00 (R/   32) OHCI Revision Number Register */
  __IO  uint32_t                       UHPFS_HcControl;    /**< Offset: 0x04 (R/W  32) HC Operating Mode Register */
  __IO  uint32_t                       UHPFS_HcCommandStatus; /**< Offset: 0x08 (R/W  32) HC Command and Status Register */
  __IO  uint32_t                       UHPFS_HcInterruptStatus; /**< Offset: 0x0C (R/W  32) HC Interrupt and Status Register */
  __IO  uint32_t                       UHPFS_HcInterruptEnable; /**< Offset: 0x10 (R/W  32) HC Interrupt Enable Register */
  __IO  uint32_t                       UHPFS_HcInterruptDisable; /**< Offset: 0x14 (R/W  32) HC Interrupt Disable Register */
  __IO  uint32_t                       UHPFS_HcHCCA;       /**< Offset: 0x18 (R/W  32) HC HCCA Address Register */
  __IO  uint32_t                       UHPFS_HcPeriodCurrentED; /**< Offset: 0x1C (R/W  32) HC Current Periodic Register */
  __IO  uint32_t                       UHPFS_HcControlHeadED; /**< Offset: 0x20 (R/W  32) HC Head Control Register */
  __IO  uint32_t                       UHPFS_HcControlCurrentED; /**< Offset: 0x24 (R/W  32) HC Current Control Register */
  __IO  uint32_t                       UHPFS_HcBulkHeadED; /**< Offset: 0x28 (R/W  32) HC Head Bulk Register */
  __IO  uint32_t                       UHPFS_HcBulkCurrentED; /**< Offset: 0x2C (R/W  32) HC Current Bulk Register */
  __IO  uint32_t                       UHPFS_HcDoneHead;   /**< Offset: 0x30 (R/W  32) HC Head Done Register */
  __IO  uint32_t                       UHPFS_HcFmInterval; /**< Offset: 0x34 (R/W  32) HC Frame Interval Register */
  __IO  uint32_t                       UHPFS_HcFmRemaining; /**< Offset: 0x38 (R/W  32) HC Frame Remaining Register */
  __IO  uint32_t                       UHPFS_HcFmNumber;   /**< Offset: 0x3C (R/W  32) HC Frame Number Register */
  __IO  uint32_t                       UHPFS_HcPeriodicStart; /**< Offset: 0x40 (R/W  32) HC Periodic Start Register */
  __IO  uint32_t                       UHPFS_HcLSThreshold; /**< Offset: 0x44 (R/W  32) HC Low-Speed Threshold Register */
  __IO  uint32_t                       UHPFS_HcRhDescriptorA; /**< Offset: 0x48 (R/W  32) HC Root Hub A Register */
  __IO  uint32_t                       UHPFS_HcRhDescriptorB; /**< Offset: 0x4C (R/W  32) HC Root Hub B Register */
  __IO  uint32_t                       UHPFS_HcRhStatus;   /**< Offset: 0x50 (R/W  32) HC Root Hub Status Register */
  __IO  uint32_t                       UHPFS_HcRhPortStatus[3]; /**< Offset: 0x54 (R/W  32) HC Port Status and Control Register (ndp = 0) */
} uhpfs_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_UHPFS_COMPONENT_H_ */
